tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            zeroGradient;
    }

    side
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            filmPyrolysisRadiativeCoupledMixed;
        pyrolysisRegion pyrolysisRegion;
        filmRegion      filmRegion;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           none;
        qr              qr;
        filmDeltaDry    0.0;
        filmDeltaWet    2e-4;
        value           $internalField;
    }
}


// ************************************************************************* //
